<!DOCTYPE HTML>
<html>
	<head>
		<!--Personalment, porto utilitzant l'Atom en python, PHP i HTML desde fa 2 anys i es el millor que he provat. Un altre que vaig probar fa temps per a HTML va ser el Brackets, peró no se com ha evolucionat. -->
		<title>Pr&aacute;ctica HTMl</title>
	</head>
	<body style="background-color:#000000; color:#FFFFFF; font-family:Arial">
		<h1>Los mejores editores HTML del 2020</h1>
		<p>Los mejores editores HTML tienen muchas funciones, y veremos eso y mucho m&aacute;s cuando repasemos nuestra lista de favoritos, todos son gratuitos y para Windows, aunque Dreamweaver solo te da un periodo de prueba gratis.</p>
		<p>As&iacute; como utilizamos todo tipo de herramientas para ayudarnos con las tareas sencillas,como la correcci&oacute;n ortogr&aacute;fica al escribir, un editor HTML (Lenguaje de marcado de hipertexto, por sus siglas en ingl&eacute;s) no es diferente y te ayuda a enmendar los errores que se comenten al escribir c&oacute;digo.</p>

		<hr>

		<h2>¿Qu&eacute; es un editor de HTML?</h2>
		<p>En retrospectiva, un editor de HTML se utiliza para escribir la base de un sitio web. Y si bien cualquier editor de texto puede hacer este trabajo, no significa que tengas que hacerlo sin ning&uacute;n tipo de ayuda. Las funciones adicionales, la comprobaci&oacute;n de errores y un editor m&aacute;s intuitivo en general, son cosas que pueden facilitarte la vida significativamente. Los fundamentos de los editores de HTML son los mismos: te ayudan a escribir c&oacute;digo resaltando las sintaxis, insertando elementos y estructuras HTML de uso com&uacute;n, y ofreciendo autocompletado.</p>
		<p>El texto que utiliza un editor HTML tambi&eacute;n se puede traducir a otros lenguajes, como CSS, XML o JavaScript. Pero como sabemos, no todas las cosas est&aacute;n hechas de la misma manera. Algunos editores pueden ser m&aacute;s f&aacute;ciles de usar, mientras que otros brindan mayor funcionalidad que otros.</p>

		<h2>¿Cu&aacute;ndo deber&iacute;as usar un editor HTML?</h2>
		<p>La respuesta corta es, ¡siempre!<br>Un editor de HTML es invaluable tanto para principiantes como para desarrolladores m&aacute;s avanzados. Ya mencionamos las caracter&iacute;sticas b&aacute;sicas de los editores de HTML, como el resaltado de sintaxis, la inserci&oacute;n de elementos HTML comunes y el autocompletado. Todo esto asegura que tu c&oacute;digo sea funcional y limpio con el menor esfuerzo, permitiendo que sea mucho m&aacute;s f&aacute;cil hacer lo que mejor sabes hacer: crear c&oacute;digo</p>

		<p>Por ejemplo, el editor te notificar&aacute; si olvidas colocar la etiqueta final &lt;/ en un elemento de c&oacute;digo. Por lo tanto, no deber&iacute;as imponerte limitaciones al no utilizar ning&uacute;n tipo de editor HTML.</p>

		<hr>

		<h2>Existen dos tipos de editores: WYSIWYG y editores HTML textuales.</h2>
		<h3>Empecemos hablando del primer tipo.</h3>

		<hr>

		<h2>Editores HTML textuales Vs. WYSIWYG</h2>

		<h3>WYSIWYG</h3>

		<p>WYSIWYG es el acr&oacute;nimo de What You See Is What You Get (Lo que ves es lo que obtienes). Estos editores proporcionan una interfaz de edici&oacute;n que muestra c&oacute;mo se ve el c&oacute;digo en una p&aacute;gina web activa. El uso de editores WYSIWYG no requiere ning&uacute;n conocimiento de HTML; por lo tanto, es mucho m&aacute;s f&aacute;cil comenzar para un usuario sin experiencia alguna en programaci&oacute;n.</p>

		<h3>Editor HTML textual</h3>

		<p>Como su nombre lo indica, los editores de HTML textuales se basan en texto. Debes tener conocimientos de HTML para utilizar este tipos de editores. Las funciones incluyen la apertura de archivos, ya sea un solo archivo, un proyecto completo o m&uacute;ltiples proyectos, y es algo disponible en todos los editores. Al utilizar un editor basado en texto, no puedes ver una vista previa en vivo del sitio.<p>

		<p>Este tipo de editor puede ofrecer m&aacute;s libertad y opciones personalizadas. Con un editor textual, puedes optimizar mejor las p&aacute;ginas web para los motores de b&uacute;squeda. Por ejemplo, es posible crear una p&aacute;gina web que siga las Pautas de accesibilidad del contenido web (WCAG, por sus siglas en ingl&eacute;s), para que las personas con discapacidades puedan ver tu p&aacute;gina web.</p>
		
		<hr>

		<h2>Lista de los mejores editores HTML en el 2020</h2>

		<h4>Como ya hemos visto qu&eacute; es un editor HTML y cu&aacute;ndo usarlo, finalmente podemos poner las manos en los editores reales y elegir el mejor editor HTML.</h4>

		<p>Todos tenemos gustos diferentes, y cuando se trata de elegir una plataforma para nuestro trabajo, donde pasaremos mucho tiempo, es importante elegir la que mejor seadapte a nosotros. Todos los editores tienes las mismas caracter&iacute;sticas b&aacute;sicas. Sin embargo, algunos ofrecen m&aacute;s representaci&oacute;n visual que otros, m&aacute;s paquetes adicionales para instalar, entre otras cosas.</p>

		<p>La lista de los mejores editores HTML se basa en la <i>popularidad</i>, las <i>funciones</i> y el <i>dise&ntilde;o</i>:</p>

		<ol>
			<li>
				<p><b>Atom</b></p>
				<p style="font-variant:small-caps">El mejor editor HTML: Atom</p>
				<p>Atom es un editor relativamente nuevo que sali&oacute; en el 2014 y ha ganado un enorme impulso desde entonces. Atom es un editor de c&oacute;digo, gratuito y de c&oacute;digo abierto, y fue desarrollado por el equipo de GitHub. Atom usa una licencia de software libre para su paquete y es mantenida por la comunidad de GitHub. Su objetivo es ofrecer una experiencia premium en el editor, y a la vez mantenerlo completamente gratis; adem&aacute;s de flexibilidad para personalizar el software en s&iacute;.</p>

				<p>En cuanto al eslogan, presumen de ser el editor de texto m&aacute;s hackeable del siglo XXI. Esto significa que los desarrolladores pueden contribuir a editar, extender, cambiar y compartir el c&oacute;digo fuente del programa, as&iacute; como crear sus propios paquetes para mejorar Atom.</p>

				<p>Ahora revisemos las caracter&iacute;sticas clave de Atom.</p>

				<ul>
					<p style=background-color:#FF0000>Caracter&iacute;sticas clave</p>
					<li>Atom viene con 81 paquetes incorporados y puedes agregar hasta 7,500 paquetes instalables adicionales. Tambi&eacute;n puedes desarrollar tu propio paquete.</li>
					<li> Editor de texto de c&oacute;digo abierto. El editor completo de Atom es un programa gratuito y de c&oacute;digo abierto y est&aacute; disponible en GitHub.</li>
					<li>Atom soporta el teletipo (Teletype). Esta es una caracter&iacute;stica importante si quieres colaborar con otros desarrolladores en tiempo real.</li>
					<li>Soporta m&uacute;ltiples paneles. Atom puede dividir la interfaz en muchas ventanas para que puedas comparar y escribir c&oacute;digo lado a lado</li>
				</ul>
				<br>
                                <ul>
                                        <p style=background-color:#FF0000>¿Por qu&eacute; los desarrolladores prefieren Atom?</p>
                                        <li>Es personalizable. Atom es muy f&aacute;cil de personalizar; se puede modificar el aspectode la interfaz y agregar otras caracter&iacute;sticas esenciales. Tambi&eacute;n puedes construir paquetes y temas desde cer>
                                        <li>Atom en modo desarrollador. Puedes experimentar agreg&aacute;ndole caracter&iacute;sticas al sistema central.</li>
                                        <li>Integraci&oacute;n con Git y GitHub.</li>
                                        <li>Edici&oacute;n multiplataforma. Atom funciona en todos los sistemas operativos.Disponible para: Windows, OS X y Linux (64 bits).</li>
                                </ul>
				<p style=font-variant:small-caps>Dise&ntilde;o<p>
				<p>Atom ofrece un dise&ntilde;o elegante con un aspecto premium.</p>
				<div align=center>
					<a href=https://atom.io target=_blank>
						<img src=https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Atom_icon.svg/1920px-Atom_icon.svg.png height=100 title="Logo Atom">
					</a>
				</div>
			</li>
			<hr>
			<li>
				<p><b>Notepad ++</b></p>
				<p style=font-variant:small-caps>Editor HTML Notepad ++</p>
				<p>Notepad ++ es un editor que fue desarrollado para m&aacute;quinas basadas en Windows. Los usuarios de Linux tambi&eacute;n pueden usarlo a trav&eacute;s de Wine. Este editor se distribuye como software libre y su repositorio tambi&eacute;n est&aacute; disponible en GitHub. Al igual que otros proyectos de la comunidad, admite plugins de terceros.</p>
				<p>Notepad ++ se distingue por su simplicidad, adem&aacute;s es s&uacute;per liviano; incluso hay una versi&oacute;n m&oacute;vil si la necesitas.</p>
				<p style=font-variant:small-caps>Aqu&iacute; hay algunos puntos destacados:</p>
				<ul>
					<p style=background-color:#FF0000>Caracter&iacute;sticas clave</p>
					<li>La interfaz de Notepad ++ es simple, liviana y r&aacute;pida.</li>
					<li>Es compatible con el entorno de programaci&oacute;n en varios idiomas, desde ActionScript, CSS hasta Visual Basic.</li>
					<li>100% compatible con Windows, aunque otros sistemas operativos no son compatibles (no hay software adicional)</li>
				</ul>
				<br>
				<ul>
					<p style=background-color:#FF0000>¿Por qu&eacute; los desarrolladores prefieren Notepad ++?</p>
					<li>Es completamente gratis.</li>
					<li>Extensible: puedes agregar plugins de la comunidad o crear los tuyos propios.</li>
					<li>Personalizable: los desarrolladores pueden personalizar las funciones y la interfaz seg&uacute;n sus preferencias.</li>
				</ul>
				<p style=font-variant:small-caps>Dise&ntilde;o</p>
				<p>La interfaz de Notepad ++ es minimalista, pero los desarrolladores pueden personalizarla.</p>

				<p style=color:#999999>Disponible para: Windows y Linux (a trav&eacute;s de Wine)</p>
				<div align=center>
					<a href=https://notepad-plus-plus.org/ target=_blank>
						<img src=https://upload.wikimedia.org/wikipedia/commons/0/0f/Notepad%2B%2B_Logo.png  height=100 title="Notepad ++">
					</a>
				</div>
			</li>
			<hr>
			<li>
				<p><b>Sublime Text</b></p>
				<p style=font-variant:small-caps>Editor de HTML Sublime Text</p>
				<p>Sublime es otro excelente editor HTML. Desarrollado por una empresa con sede en Sydney, este software se encuentra en la categor&iacute;a de freemium. Freemium significa que puedes usar Sublime de forma gratuita, pero debes comprar una licencia para poder disfrutar de todas las funciones.</p>
				<p>Sublime ofrece muy buen soporte para garantizar que el programa se actualice constantemente. Los usuarios pueden agregar plugins creados por la comunidad o crear los suyos propios. Creemos que usar la versi&oacute;n gratuita de Sublime es m&aacute;s que suficiente. Sin embargo, si crees que necesitas m&aacute;s funciones, puede obtener la licencia m&aacute;s adelante.</p>
				<ul>
					<p style=background-color:#FF0000>Caracter&iacute;sticas clave</p>
					<li>Sublime es compatible con la API de Python que le permite al plugin expandir su funcionalidad predeterminada.</li>
					<li>Edici&oacute;n simult&aacute;nea. Puedes realizar cambios en muchas &aacute;reas seleccionadas al mismo tiempo.</li>
					<li>Sublime est&aacute; disponible en Windows, OS X y Linux. Los desarrolladores solo necesitan tener una licencia para usar Sublime en todas las computadoras que tengan.</li>
				</ul>
				<br>
				<ul>
					<p style=background-color:#FF0000>¿Por qu&eacute; los desarrolladores prefieren Sublime Text?</p>
					<li>API potente y ecosistema de paquetes. Sublime proporciona miles de paquetes que est&aacute;n disponibles y construidos por la comunidad. Estos paquetes son de c&oacute;digo abierto.</li>
					<li>Edici&oacute;n por separado. Los desarrolladores pueden usar m&uacute;ltiples monitores y editar diferentes tipos de c&oacute;digo simult&aacute;neamente.</li>
					<li>Ir a cualquier cosa (Go to Anything). Esta funci&oacute;n es &uacute;til para abrir los archivos con unas pocas teclas, para buscar s&iacute;mbolos, l&iacute;neas o palabras.</li>
				</ul>
				<p style=font-variant:small-caps>Dise&ntilde;o</p>
				<p>La interfaz de Sublime Text es excelente en t&eacute;rminos de est&eacute;tica.</p>
				
				<p style=color:#999999>Disponible para: Windows, OS X y Linux (32/64 bit).</p>
                                <div align=center>
                                        <a href=http://www.sublimetext.com/ target=_blank>
                                                <img src=https://upload.wikimedia.org/wikipedia/en/d/d2/Sublime_Text_3_logo.png  height=100 title="Sublime Text">
                                        </a>
                                </div>
			</li>
			<hr>
			<li>
				<p><b>Adobe Dreamweaver CC</b></p>
				<p style=font-variant:small-caps>Adobe Dreamweaver CC</p>
				<p>Desarrollado y administrado por el gigante tecnol&oacute;gico Adobe Inc, Adobe Dreamweaver CC es una herramienta excelente, potente y vers&aacute;til. Sirve tanto para el desarrollo de back-end como de front-end. Como software de c&oacute;digo cerrado, Dreamweaver est&aacute; dise&ntilde;ado para funcionar dentro del ecosistema de Adobe. Adobe tambi&eacute;n proporciona soporte, complementos y funciones para asegurarse de que siempre codificar&aacute;s sin inconvenientes</[>
				<p>Dreamweaver es uno de los editores que admite tanto el m&eacute;todo textual como el WYSIWYG. Por lo tanto, tu eliges si quieres programar con una presentaci&oacute;n visual envivo o seguir el camino cl&aacute;sico.</p>

				<ul>
					<p style=background-color:#FF0000>Caracter&iacute;sticas clave</p>
					<li>Dreamweaver te permite escribir c&oacute;digo en todos los lenguajes de programaci&oacute;n importantes.</li>
					<li>Soporta modos de editor textual y WYSIWYG.</li>
					<li>Totalmente integrado con el ecosistema de software de Adobe.</li>
					<li>Incre&iacute;ble rendimiento y soporte de Adobe Inc.</li>
				</ul>
				<hr>
				<ul>
					<p style=background-color:#FF0000>¿Por qu&eacute; los desarrolladores prefieren Adobe Dreamweaver CC?</p>
					<li>Vista previa. De esta manera, los desarrolladores pueden programar mientras previsualizan el producto final.</li>
					<li>Confirmar el c&oacute;digo y accesibilidad de la p&aacute;gina. Esta caracter&iacute;stica puede facilitarle a los desarrolladores seguir las Pautas de accesibilidad de contenido web (WCAG).</li>
					<li>Acceso a bibliotecas creativas en la nube. Acceso premium a la abundante oferta demateriales en el ecosistema de Adobe. Desde colores, palabras, gr&aacute;ficos, capas, caracteres y mucho m&aacute;s.</li>
				</ul>
				<p style=font-variant:small-caps>Dise&ntilde;o</p>
				<p>Dreamweaver tiene un aspecto premium de primera clase, con una est&eacute;tica y un dise&ntilde;o impresionantes. Despu&eacute;s de todo, est&aacute; hecho por Adobe, una compa&ntilde;&iacute;a respetada en la industria creativa.</p>
				<p style=color:#999999>Disponible para: Windows y OS X</p>
				<div align=center>
					<a href=https://www.adobe.com/products/dreamweaver.html target=_blank>
						<img src=https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Adobe_Dreamweaver_CC_icon.svg/1024px-Adobe_Dreamweaver_CC_icon.svg.png height=100 title="DreamWeaver CC">
					</a>
				</div>
			</li>
		</ol>
		<hr>
		<h2><u>Conclusi&oacute;n</u></h2>
		<p>Recibir ayuda para escribir c&oacute;digo de forma m&aacute;s r&aacute;pida y eficiente se est&aacute; convirtiendoen una necesidad, ahora m&aacute;s que nunca. Tanto si empezaste a programar hace pocoo si eres un veterano, creemos que un editor HTML puede convertirse en el mejor amigo de cualquiera. Aparte de las funciones, elegir el mejor editor HTML que se adapte a ti puede ser dif&iacute;cil. Te recomendamos experimentar con diferentes editores y elegir el que se adapte mejor a tu estilo y flujo de trabajo.</p>
		<p>Tambi&eacute;n queremos mencionar que a menos que necesites soporte 24/7 y administres el c&oacute;digo para una gran compa&ntilde;&iacute;a, probablemente no tendr&aacute;s problemas con un editor gratuito.</p>
	</body>
</html>
